app/views/articles/index.html.erb

SELECT "articles".* FROM "articles"
---
			<div style="text-align: center">
				<%= will_paginate @articles = Article.paginate(:page => params[:page], :per_page => 1), renderer: FoundationPagination::Rails %>