app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = $1 AND "articles"."id" = $2  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 1], ["id", 1]]
---
	def edit
		@article = current_user.articles.find(params[:id])

INSERT INTO "articles" ("body", "created_at", "excerpt", "location", "published_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		@article = current_user.articles.new(article_params)
		respond_to do |format|
			if @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = $1 AND "articles"."id" = $2  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 1], ["id", 2]]
UPDATE "articles" SET "body" = $1, "excerpt" = $2, "location" = $3, "title" = $4, "updated_at" = $5 WHERE "articles"."id" = 2
---
	def update
		@article = current_user.articles.find(params[:id])
		respond_to do |format|
			if @article.update(article_params)

SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = $1 AND "articles"."id" = $2  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 1], ["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 1]]
---
	def destroy
		@article = current_user.articles.find(params[:id])
		@article.destroy

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
---
	def notify_friend
		@article = Article.find(params[:id])