app/controllers/comments_controller.rb

	def create
		@comment = @article.comments.new(comment_params)
		if @comment.save
---
INSERT INTO "comments" ("article_id", "body", "created_at", "email", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

	def destroy
		@article = current_user.articles.find(params[:article_id])
		@comment = @article.comments.find(params[:id])
		@comment.destroy
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = $1 AND "articles"."id" = $2  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 1], ["id", 1]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."article_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["article_id", 1], ["id", 7]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 7]]

	def load_article
		@article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]