app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "hashed_password", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-11-29 03:22:13.237336"], ["email", "vanessasoutoc@gmail.com"], ["hashed_password", "c0b92d70ec767dca30c7b8de036721edd59d96c3"], ["updated_at", "2014-11-29 03:22:13.237336"]]
---
	def create
		@user = User.new(user_params)
		if @user.save

UPDATE "users" SET "email" = $1, "hashed_password" = $2, "updated_at" = $3 WHERE "users"."id" = 1  [["email", "vanessasoutoc@hotmail.com"], ["hashed_password", "c0b92d70ec767dca30c7b8de036721edd59d96c3"], ["updated_at", "2014-11-29 02:49:30.936851"]]
---
	def update
		@user = current_user
		if @user.update(user_params)